In [90]:
import pandas as pd

In [92]:
d = {
    "sales": [100000, 222000, 1000000, 522000, 111111],
    "city": ["Tampa", "Tampa", "Orlando", "Jacksonville", "Miami"],
    "size": ["Small", "Medium", "Large", "Large", "Small"]
}

In [94]:
df = pd.DataFrame(d)

In [96]:
df.head()

     sales          city    size
0   100000         Tampa   Small
1   222000         Tampa  Medium
2  1000000       Orlando   Large
3   522000  Jacksonville   Large
4   111111         Miami   Small

In [98]:
from sklearn.preprocessing import OneHotEncoder

In [100]:
ohe = OneHotEncoder(handle_unknown='ignore',sparse_output = False).set_output(transform='pandas')

In [102]:
ohetransform = ohe.fit_transform(df[['city']])

In [80]:
ohetransform

   city_Jacksonville  city_Miami  city_Orlando  city_Tampa
0                0.0         0.0           0.0         1.0
1                0.0         0.0           0.0         1.0
2                0.0         0.0           1.0         0.0
3                1.0         0.0           0.0         0.0
4                0.0         1.0           0.0         0.0

In [82]:
df.head()

     sales          city    size
0   100000         Tampa   Small
1   222000         Tampa  Medium
2  1000000       Orlando   Large
3   522000  Jacksonville   Large
4   111111         Miami   Small

In [84]:
ohetransform.head()

   city_Jacksonville  city_Miami  city_Orlando  city_Tampa
0                0.0         0.0           0.0         1.0
1                0.0         0.0           0.0         1.0
2                0.0         0.0           1.0         0.0
3                1.0         0.0           0.0         0.0
4                0.0         1.0           0.0         0.0

In [106]:
df = pd.concat([df, ohetransform], axis=1).drop(columns=['city'])

In [108]:
df.head()

     sales    size  city_Jacksonville  city_Miami  city_Orlando  city_Tampa
0   100000   Small                0.0         0.0           0.0         1.0
1   222000  Medium                0.0         0.0           0.0         1.0
2  1000000   Large                0.0         0.0           1.0         0.0
3   522000   Large                1.0         0.0           0.0         0.0
4   111111   Small                0.0         1.0           0.0         0.0